import CommentItem from "@/components/dashboard/comments-management/comment-item";
const comments = [
  {
    id: 1,
    fullName: "محمد رضایی",
    title: "بارثاوا بهترینه!",
    phoneNumber: "09150098099",
    message:
      "جشنمون دقیقا همون vibesی شد که می‌خواستیم. همه چیز تمیز، مینیمال و خیلی شیک ✨🎉",
  },
  {
    id: 2,
    fullName: "الهه مرادی",
    title: "واقعا متفاوت بود!",
    phoneNumber: "09150098099",
    message:
      "تمام جزئیات با وسواس طراحی شده بود. حس کردیم همه چیز داره برای ما اجرا میشه 💐",
  },
  {
    id: 3,
    fullName: "سینا کریمی",
    title: "پیشنهاد می‌کنم!",
    phoneNumber: "09150098099",
    message:
      "مراسم بدون استرس و فوق‌العاده زیبا بود. تیم خیلی حرفه‌ای عمل کردن 😎",
  },
  {
    id: 4,
    fullName: "هانیه نیک‌پور",

    phoneNumber: "09150098099",
    title: "فراتر از انتظار!",
    message: "دکور، موزیک، نظم... همه چیز عالی بود. حس کردیم تو فیلمیم 🎬",
  },
  {
    id: 5,
    fullName: "پارمیس سادات",

    phoneNumber: "09150098099",
    title: "بی‌نقص و آروم!",
    message: "از لحظه ورود فهمیدیم همه چیز تحت کنترله. واقعا آرامش‌بخش بود ☁️",
  },
  {
    id: 6,
    fullName: "آرین باقری",
    title: "واقعا حرفه‌ای!",
    phoneNumber: "09150098099",
    message:
      "تیم اجرا انگار دقیقا می‌دونستن چی می‌خوایم. همه چیز دقیق انجام شد 🔥",
  },
  {
    id: 7,
    fullName: "پرنیا احمدی",
    title: "دکور فوق‌العاده!",
    phoneNumber: "09150098099",
    message:
      "چیدمان گل و نورها انقدر قشنگ بود که همه مهمونا داشتن عکس می‌گرفتن 📸",
  },
  {
    id: 8,
    fullName: "یاسین شریفی",
    title: "خاطره‌انگیز!",
    phoneNumber: "09150098099",
    message:
      "یکی از بهترین شب‌های زندگیمون شد. فضای مراسم فوق‌العاده شاعرانه بود 🌙",
  },
];
export default function CommentsManagement() {
  return (
    <div className="h-full w-full bg-[rgba(236,236,236,0.8)] p-5 flex max-h-full overflow-y-auto gap-5 flex-col">
      <b className="text-2xl my-2">نظرات کاربران !</b>
      <div className="grid gap-5">
        {comments.map((comment) => (
          <CommentItem key={comment.id} data={comment} />
        ))}
      </div>
    </div>
  );
}
