interface MenuSection {
  title: string;
  items: string[];
}

export interface MenuItem {
  title: string;
  image: string;
  description: string;
  mainFood: string[];
  desserts: string[];
  sections: MenuSection[];
  ceremonies: string[];
}

interface MenuDataType {
  PorsiMenus: MenuItem[];
  SelfMenus: MenuItem[];
  SelectedMenu: MenuItem[];
}

export const menuData: MenuDataType = {
  PorsiMenus: [
    {
      title: "منوی پرسی ۱",
      description:
        "مجموعه‌ای کامل از غذاهای اصلی، نوشیدنی‌ها، سالاد و پذیرایی عصرانه برای مهمانی‌های باشکوه.",
      image: "/images/food-menu/640A1000.webp",
      mainFood: ["چلو ماهیچه"],
      desserts: ["ژله (۲ نوع انتخابی)", "کرم کارامل", "موس", "تیرامیسو"],
      sections: [
        {
          title: "انواع سالاد",
          items: ["فصل", "ماکارونی"],
        },
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دلستر", "دوغ"],
        },
        {
          title: "پذیرایی عصرانه",
          items: [
            "میوه ۵ نوع (فصل)",
            "شیرینی ۴ نوع",
            "کافه گلاسه همراه با آبمیوه",
          ],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "گل‌آرایی میز مهمانان سمت بانوان",
        "کیک مراسم",
        "پخش کلیپ با دستگاه ویدیو پروجکشن فول اچ دی",
        "دی‌جی دو طرف همراه با نورافشانی",
        "آتش‌بازی گرم در ۲ مرحله",
        "گل‌آرایی ماشین و دسته گل",
      ],
    },
    {
      title: "منو پرسی 2",
      image: "/images/food-menu/DSC07600.webp",
      description:
        "مجموعه‌ای کامل از غذاهای اصلی، نوشیدنی‌ها، سالاد و پذیرایی عصرانه برای مهمانی‌های باشکوه.",

      mainFood: ["چلو گوشت"],
      desserts: ["ژله (2 نوع)", "کرم کارامل", "موس", "تیرامیسو"],
      sections: [
        { title: "نوشیدنی", items: ["دلستر", "دوغ", "نوشابه"] },
        {
          title: "پذیرایی عصرانه",
          items: [
            "میوه ۵ نوع (فصل)",
            "شیرینی ۴ نوع",
            "کافه گلاسه همراه با آبمیوه",
          ],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش های متنوع", "تنقلات کامل"],
        },
        { title: "انواع سالاد", items: ["فصل", "ماکارونی"] },
      ],
      ceremonies: [
        "سفره عقد با گل آرایی و شمع آرایی گل آرایی میز روی میز سمت بانوان کیک مراسم",
        "پخش کیلیپ با دستگاه ویدیو پروژه فول اچ دی",
        "دی جی دو طرف",
        "همراه با نور افشانی آتش بازی گرم در ۲ مرحله گل آرایی ماشین و دسته گل",
      ],
    },

    {
      title: "منوی پرسی ۳",
      image: "/images/food-menu/DSC07630.webp",
      description:
        "مجموعه‌ای کامل از غذاهای اصلی، نوشیدنی‌ها، سالاد و پذیرایی عصرانه برای مهمانی‌های باشکوه.",
      mainFood: [
        "برنج زعفرانی باقالی پلو بدون گوشت",
        "جوجه بی استخوان یا مرغ درسته",
        "کباب کوبیده یا رولت گوشت",
        "قیمه",
        "سالاد فصل",
      ],
      desserts: ["ژله (۲ نوع)", "کرم کارامل", "ترکیبی"],
      sections: [
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دوغ"],
        },
        {
          title: "پذیرایی عصرانه",
          items: [
            "میوه ۴ نوع (فصل)",
            "شیرینی ۳ نوع",
            "بستنی سنتی یا کافه گلاسه",
          ],
        },
        {
          title: "چایخانه سنتی",
          items: ["کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "کیک مراسم",
        "پخش کلیپ با دستگاه ویدیو پروجکشن فول اچ دی",
        "دی جی دو طرف همراه با نورافشانی",
        "آتش‌بازی گرم در ۲ مرحله",
      ],
    },
  ],
  SelfMenus: [
    {
      title: "منوی سلف ۱",
      description:
        "منوی کامل و متنوع برای پذیرایی حرفه‌ای با غذاهای ایرانی و تشریفات کامل.",
      image: "/images/food-menu/DSC07634.webp",
      mainFood: [
        "برنج سفید زعفرانی",
        "باقالا پلو با گوشت",
        "شیرین پلو با مرغ",
        "چلو جوجه کباب با استخوان و بدون استخوان",
        "ژیگو",
        "کباب لقمه",
        "ته‌چین مرغ",
        "خوراک زبان",
        "بیف استراگانف",
        "مرغ و گوشت",
        "خورشت قیمه",
        "خورشت فسنجان یا قرمه‌سبزی",
      ],
      desserts: ["دسر متنوع"],
      sections: [
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دلستر", "دوغ"],
        },
        {
          title: "انواع سالاد",
          items: [
            "فصل",
            "کالباس",
            "ماکارونی",
            "شیرازی (روسی)",
            "اردور",
            "فینگر فود",
          ],
        },
        {
          title: "پذیرایی عصرانه",
          items: [
            "میوه ۶ نوع (فصل)",
            "شیرینی ۵ نوع",
            "کافه گلاسه همراه با آبمیوه",
          ],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "گل‌آرایی ورودی",
        "گل‌آرایی میز مهمانان سمت آقایان و بانوان",
        "کیک مراسم",
        "دی‌جی دو طرف همراه با نورافشانی",
        "پخش کلیپ",
        "آتش‌بازی گرم در ۲ مرحله",
        "گل‌آرایی ماشین و دسته گل",
      ],
    },
    {
      title: "منوی سلف ۲",
      description:
        "منوی متنوع با غذاهای ایرانی محبوب و خدمات کامل برای مراسم شیک.",
      image: "/images/food-menu/DSC07690.webp",
      mainFood: [
        "برنج سفید زعفرانی",
        "باقالا پلو با گوشت",
        "شیرین پلو با مرغ",
        "چلو جوجه کباب با استخوان و بدون استخوان",
        "ژیگو",
        "کباب لقمه",
        "ته‌چین مرغ",
        "خوراک زبان",
        "خورشت قیمه",
        "خورشت فسنجان یا قرمه‌سبزی",
      ],
      desserts: ["دسر متنوع"],
      sections: [
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دلستر", "دوغ"],
        },
        {
          title: "انواع سالاد",
          items: [
            "فصل",
            "کالباس",
            "ماکارونی",
            "شیرازی (روسی)",
            "اردور",
            "فینگر فود",
          ],
        },
        {
          title: "پذیرایی عصرانه",
          items: [
            "میوه ۶ نوع (فصل)",
            "شیرینی ۵ نوع",
            "کافه گلاسه همراه با آبمیوه",
          ],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "گل‌آرایی ورودی",
        "گل‌آرایی میز مهمانان سمت آقایان و بانوان",
        "کیک مراسم",
        "دی‌جی دو طرف همراه با نورافشانی",
        "پخش کلیپ",
        "آتش‌بازی گرم در ۲ مرحله",
        "گل‌آرایی ماشین و دسته گل",
      ],
    },
    {
      title: "منوی سلف ۳",
      description: "غذاهای اصلی متنوع با طعم سنتی و سرو کامل.",

      image: "/images/food-menu/DSC07773-Edit.webp",
      mainFood: [
        "برنج سفید زعفرانی",
        "باقالا پلو با گوشت",
        "شیرین پلو با مرغ",
        "جوجه کباب با استخوان و بدون استخوان",
        "ژیگو",
        "کباب لقمه",
        "ته‌چین مرغ",
        "خورشت قیمه",
        "خورشت فسنجان یا قرمه سبزی",
      ],
      desserts: ["دسر متنوع"],
      sections: [
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دلستر", "دوغ"],
        },
        {
          title: "انواع سالاد",
          items: [
            "فصل",
            "کالباس",
            "ماکارونی",
            "شیرازی (روسی)",
            "اردور",
            "فینگر فود",
          ],
        },
        {
          title: "پذیرایی عصرانه",
          items: ["میوه ۶ نوع", "شیرینی ۵ نوع", "کافه گلاسه همراه با آبمیوه"],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "گل‌آرایی ورودی",
        "گل‌آرایی میز مهمانان سمت آقایان و بانوان",
        "کیک مراسم",
        "دی‌جی دو طرف همراه با نورافشانی",
        "پخش کلیپ",
        "آتش‌بازی گرم در ۲ مرحله",
        "گل‌آرایی ماشین و دسته گل",
      ],
    },

    {
      title: "منوی سلف ۴",
      image: "/images/food-menu/DSC07774.webp",
      description: "مجموعه‌ای از نوشیدنی‌ها و سالادهای تازه برای تمام سلایق.",

      mainFood: [
        "برنج سفید زعفرانی",
        "باقالا پلو با گوشت",
        "شیرین پلو با مرغ",
        "جوجه کباب با استخوان و بدون استخوان",
        "رولت گوشت",
        "کباب لقمه",
        "خورشت قیمه",
        "خورشت فسنجان یا قرمه سبزی",
      ],
      desserts: ["دسر متنوع"],
      sections: [
        {
          title: "نوشیدنی",
          items: ["نوشابه", "دلستر", "دوغ"],
        },
        {
          title: "انواع سالاد",
          items: ["فصل", "کالباس", "ماکارونی", "اردور", "فینگر فود"],
        },
        {
          title: "پذیرایی عصرانه",
          items: ["میوه ۵ نوع", "شیرینی ۵ نوع", "کافه گلاسه همراه با آبمیوه"],
        },
        {
          title: "چایخانه سنتی",
          items: ["چای", "کافه میکس", "دمنوش‌های متنوع", "تنقلات کامل"],
        },
      ],
      ceremonies: [
        "سفره عقد با گل‌آرایی و شمع‌آرایی",
        "گل‌آرایی میز مهمانان سمت بانوان",
        "کیک مراسم",
        "دی‌جی دو طرف همراه با نورافشانی",
        "پخش کلیپ",
        "آتش‌بازی گرم در ۲ مرحله",
        "گل‌آرایی ماشین و دسته گل",
      ],
    },
  ],
  SelectedMenu: [
    {
      title: "منوی انتخابی 1",
      description:
        "منوی متنوع با غذاهای ایرانی محبوب و خدمات کامل برای مراسم شیک.",
      image: "/images/food-menu/DSC07781-Edit.webp",
      mainFood: [
        "گوشت درسته",
        "مرغ بریان",
        "بوقلمون",
        "ماهی",
        "بیف استروگانف",
        "کباب سیخی",
        "کوکو شیرین",
        "ته‌چین مرغ",
        "گوشت تکه‌ای",
        "خوراک زبان",
      ],
      desserts: [],
      sections: [],
      ceremonies: [],
    },
    {
      title: "منوی انتخابی 2",
      description:
        "منوی متنوع با غذاهای ایرانی محبوب و خدمات کامل برای مراسم شیک.",
      image: "/images/food-menu/IMG_0334.webp",
      mainFood: [
        "گوشت درسته",
        "مرغ بریان",
        "بوقلمون",
        "ماهی",
        "بیف استروگانف",
        "کباب سیخی",
        "کوکو شیرین",
        "ته‌چین مرغ",
        "گوشت تکه‌ای",
        "خوراک زبان",
      ],
      desserts: [],
      sections: [],
      ceremonies: [],
    },
  ],
};
